Tekla Open API Reference for Tekla Structures 2025
WpfFilterCheckBox Class
 The WpfFilterAttribute class represents a checkbox control for enabling/disabling dialog attributes defined with StructuresFieldAttribute.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.Primitives.ButtonBase
 System.Windows.Controls.Primitives.ToggleButton
 System.Windows.Controls.CheckBox
 Tekla.Structures.Dialog.UIControls.WpfFilterCheckBox
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfFilterCheckBox : CheckBox
Public Class WpfFilterCheckBox
	Inherits CheckBox
The WpfFilterCheckBox type exposes the following members.
Constructors
Name | Description
WpfFilterCheckBox
 Initiates a new instance of the control.
Top
Properties
Name | Description
AttributeName
 Dialog attribute name defined with StructuresFieldAttribute
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace